# У вас есть абстракция учитель, вам надо написать класс
# согласно этой абстракции характеристики класса:
# Поля (атрибуты) класса class Teacher:
# имя (name) в примере Иван Петров;
# образование (education) в примере БГПУ;
# опыт работы (experience) в примере 4 года;
# Все атрибуты необходимо сделать защищенными.
# Для данных атрибутов необходимо написать геттеры (для всех)
# а для атрибута опыт работы (experience) также необходим еще и
# сеттер.
# Методы класса Teacher.
# get_teacher_data возвращает информацию об учителе
# результат вызова метода:
# add_mark в качестве аргументов принимает имя студента и
# его оценку, результат вызова метода:
# remove_mark в качестве аргументов принимает имя
# студента и его оценку, результат вызова метода:
# give_a_consultation в качестве аргумента принимает, класс
# в котором учатся ученики, результат вызова метода: