# Написать класс наследник DisciplineTeacher, его классом
# родителем (базовым классом) будет класс Teacher, ему
# необходимо добавить 2 новых атрибута.
# discipline - предмет его надо перенести из класса Teacher;
# job_title - должность (например завуч, директор, учитель
# старших классов).
# Все атрибуты необходимо сделать защищенными.
# Для данных атрибутов необходимо написать геттеры (для всех)
# а для атрибута job_title также необходим еще и сеттер.
# Далее необходимо адаптировать методы класса родителя а
# именно:
# get_teacher_data
# add_mark
# remove_mark
# give_a_consultation
# Ниже приведены примеры вызова методов